MikroElektronika/core_packages/ARM/gcc_clang/def/silabs/EZR32HG320F64R61/mcu.h
/** @} End of group EZR32HG320F64R61_Peripheral_Base */

/***************************************************************************//**
 * @defgroup EZR32HG320F64R61_Peripheral_Declaration  EZR32HG320F64R61 Peripheral Declarations
 * @{
 ******************************************************************************/

#define AES          ((AES_TypeDef *) AES_BASE)             /**< AES base pointer */
#define DMA          ((DMA_TypeDef *) DMA_BASE)             /**< DMA base pointer */
#define USB          ((USB_TypeDef *) USB_BASE)             /**< USB base pointer */
#define MSC          ((MSC_TypeDef *) MSC_BASE)             /**< MSC base pointer */
#define EMU          ((EMU_TypeDef *) EMU_BASE)             /**< EMU base pointer */
#define RMU          ((RMU_TypeDef *) RMU_BASE)             /**< RMU base pointer */
#define CMU          ((CMU_TypeDef *) CMU_BASE)             /**< CMU base pointer */
#define TIMER0       ((TIMER_TypeDef *) TIMER0_BASE)        /**< TIMER0 base pointer */
#define TIMER1       ((TIMER_TypeDef *) TIMER1_BASE)        /**< TIMER1 base pointer */
#define TIMER2       ((TIMER_TypeDef *) TIMER2_BASE)        /**< TIMER2 base pointer */
#define USART0       ((USART_TypeDef *) USART0_BASE)        /**< USART0 base pointer */
#define USARTRF1     ((USART_TypeDef *) USARTRF1_BASE)      /**< USARTRF1 base pointer */
#define PRS          ((PRS_TypeDef *) PRS_BASE)             /**< PRS base pointer */
#define IDAC0        ((IDAC_TypeDef *) IDAC0_BASE)          /**< IDAC0 base pointer */
#define GPIO         ((GPIO_TypeDef *) GPIO_BASE)           /**< GPIO base pointer */
#define VCMP         ((VCMP_TypeDef *) VCMP_BASE)           /**< VCMP base pointer */
#define ADC0         ((ADC_TypeDef *) ADC0_BASE)            /**< ADC0 base pointer */
#define LEUART0      ((LEUART_TypeDef *) LEUART0_BASE)      /**< LEUART0 base pointer */
#define PCNT0        ((PCNT_TypeDef *) PCNT0_BASE)          /**< PCNT0 base pointer */
#define I2C0         ((I2C_TypeDef *) I2C0_BASE)            /**< I2C0 base pointer */
#define RTC          ((RTC_TypeDef *) RTC_BASE)             /**< RTC base pointer */
#define WDOG         ((WDOG_TypeDef *) WDOG_BASE)           /**< WDOG base pointer */
#define MTB          ((MTB_TypeDef *) MTB_BASE)             /**< MTB base pointer */
#define CALIBRATE    ((CALIBRATE_TypeDef *) CALIBRATE_BASE) /**< CALIBRATE base pointer */
#define DEVINFO      ((DEVINFO_TypeDef *) DEVINFO_BASE)     /**< DEVINFO base pointer */
#define ROMTABLE     ((ROMTABLE_TypeDef *) ROMTABLE_BASE)   /**< ROMTABLE base pointer */

/** @} End of group EZR32HG320F64R61_Peripheral_Declaration */

/***************************************************************************//**
 * @defgroup EZR32HG320F64R61_BitFields EZR32HG320F64R61 Bit Fields
 * @{
 ******************************************************************************/

// #include "ezr32hg_prs_signals.h"  // Note: Changed for MikroE implementation.
// #include "ezr32hg_dmareq.h"  // Note: Changed for MikroE implementation.
// #include "ezr32hg_dmactrl.h"  // Note: Changed for MikroE implementation.
// #include "ezr32hg_usartrf.h"  // Note: Changed for MikroE implementation.

/***************************************************************************//**
 * @defgroup EZR32HG320F64R61_UNLOCK EZR32HG320F64R61 Unlock Codes
 * @{
 ******************************************************************************/
#define MSC_UNLOCK_CODE      0x1B71 /**< MSC unlock code */
#define EMU_UNLOCK_CODE      0xADE8 /**< EMU unlock code */
#define CMU_UNLOCK_CODE      0x580E /**< CMU unlock code */
#define TIMER_UNLOCK_CODE    0xCE80 /**< TIMER unlock code */
#define GPIO_UNLOCK_CODE     0xA534 /**< GPIO unlock code */

/** @} End of group EZR32HG320F64R61_UNLOCK */

/** @} End of group EZR32HG320F64R61_BitFields */

/***************************************************************************//**
 * @defgroup EZR32HG320F64R61_Alternate_Function EZR32HG320F64R61 Alternate Function
 * @{
 ******************************************************************************/

// #include "ezr32hg_af_ports.h"  // Note: Changed for MikroE implementation.
// #include "ezr32hg_af_pins.h"  // Note: Changed for MikroE implementation.

/** @} End of group EZR32HG320F64R61_Alternate_Function */

/***************************************************************************//**
 *  @brief Set the value of a bit field within a register.
 *
 *  @param REG
 *       The register to up2026-04-27
 *  @param MASK
 *       The mask for the bit field to up2026-04-27
 *  @param VALUE
 *       The value to write to the bit field
 *  @param OFFSET
 *       The number of bits that the field is offset within the register.
 *       0 (zero) means LSB.
 ******************************************************************************/
#define SET_BIT_FIELD(REG, MASK, VALUE, OFFSET) \
  REG = ((REG) &~(MASK)) | (((VALUE) << (OFFSET)) & (MASK));

/** @} End of group EZR32HG320F64R61 */

/** @} End of group Parts */

#ifdef __cplusplus
}
#endif

#endif /* EZR32HG320F64R61_H */
